// 1. Вам дана переменная num, присвойте ей значение. Выведите значение этой переменной в консоль. 

// let num = 42; // Присвоим переменной num значение 42
// console.log(num); // Выведем значение переменной num в консоль

// 2. Вам даны переменные a=10, b=2 и c=5. Выведите в консоль их сумму. 

// let a = 10;
// let b = 2;
// let c = 5;
// console.log(a + b + c)

// 3. Вам дана переменная со значением 100, выведите в консоль умноженную переменную на 2. 

// let num = 100
// console.log(num * 2)

// 4. Вам дана переменная со значением 67. Выведите в консоль остаток деления на 7. 

// let num = 67;
// let remainder = num % 7;

// console.log("Остаток от деления 67 на 7: " + remainder);

// 5. Вам даны переменные a=10 и b=2. Выведите в консоль их сумму, разность, произведение и частное (результат деления).

// let a = 10;
// let b = 2;

// let sum = a + b;
// let difference = a - b;
// let product = a * b;
// let quotient = a / b;

// console.log("Сумма: " + sum);
// console.log("Разность: " + difference);
// console.log("Произведение: " + product);
// console.log("Частное: " + quotient);

// 6. Вам даны переменные c=15 и d=2. Просуммируйте их, а результат присвойте переменной result. Выведите в консоль значение переменной result. 

// let c = 15 
// let d = 2

// let result = (c + d)

// console.log(result)

// 7. Вам даны переменные a=30, и b=15 Сложите переменные a и b и результат присвойте переменной c. Затем выведите в консоль остаток деления на 4 переменной c. 

// let a = 30
// let b = 15

// let c = a + b

// console.log(c*2)

// 8. Вам даны переменные a=17 и b=10. Отнимите от a переменную b и результат присвойте переменной c. Затем создайте переменную d, присвойте ей значение. Сложите переменные c и d, а результат запишите в переменную result. Выведите в консоль значение переменной result. 

// let a = 17
// let b = 10

// let c = a - b

// let d = 5;

// let result = c + d;

// console.log("Значение переменной result: " + result);

// 9. Вам даны a='10' и b='99'. Сложите переменные a и b и присвойте результат переменной result и выведите её в консоль. 

// let a = 10
// let b = 99

// let result = a + b;

// console.log(result);

// 10. Вам даны переменные name='лет', number=10. Сложите данные переменные, присвойте результат переменной result и выведите её в консоль.

// let name = 'лет'
// let number = 10

// let result = name + number

// console.log(result);