// Циклы

// for (let i = 1; i <= 15; i++) {
//     console.log(i)
// }

///////////////////////////////////////////////

// let a = 'Khairulloh'

// for (let i = 0; i <= a.length; i++) {
//     console.log(a[i])
// }

// for (i = a.length - 1; i >= 0; i--) {
//     console.log(a[i])
// }

///////////////////////////////////////////////

// let a = 'рекомендаця'

// for (let i = 0; i < a.length / 2; i++) {
//     console.log(a[i])
// }

///////////////////////////////////////////////

// let a = 20

// for (i = 2; i <= 20; i = i + 2) {
//     console.log(i)
// }

///////////////////////////////////////////////

// let a = 'abracadabra'
// let result = 0

// for (let i = 0; i < a.length; i++) {
//     if (a[i] === 'a') {
//         result++
//     }
// }
// console.log(result)

///////////////////////////////////////////////

// let a = 'abracadabra'
// let result = 0

// for (let i = 0; i < a.length; i++) {
//     if (a[i] !== 'a') {
//         result++
//     }
// }
// console.log(result)

///////////////////////////////////////////////

// let a = 10

// for (i = 1; i <= 10; i++) {
//     if (a % i === 0) {
//     console.log(`Цифра ${i} делится без остатков от цифры ${a}`)
//     }
// }

///////////////////////////////////////////////

// let a = 'Hello World'
// let result = 0

// for (i = 0; i < a.length; i++) {
//     if(a[i] === a[i].toUpperCase() && a[i] !== ' ') {
//         result++
//     }
// }
// console.log(result)

///////////////////////////////////////////////

// let a = 'abracadabra'
// let b = ''

// for (i = 0; i < a.length; i = i + 2) {
//     b = b + a[i]
// }
// console.log(b)

///////////////////////////////////////////////

// let a = '9876'
// let result = 0

// for (i = 0; i < a.length; i++) {
//     result = result + +a[i]
// }
// console.log(result)

///////////////////////////////////////////////

// let a = '123789'
// let result = 0

// for (i = 0; i < a.length; i++) {
//     if (result > a[i]) {
//         result = a[i]
//     } 
// }
// console.log(result)

//////////////////////// HOME WORK ///////////////////////

// 1 Сумма чисел от 1 до 100

// let sum = 0;

// for (let i = 1; i <= 100; i++) {
//     sum++
// }
// console.log(sum)

///////////////////////////////////////////////

// 2 Дан строк элементами '12345'. Напишите программу, которая вычисляет сумму всех чисел в строке.

// let a = '12345'
// let result = 0

// for (i = 0; i < a.length; i++) {
//     result = result + +a[i]
// }
// console.log(result)

///////////////////////////////////////////////

// 3 Напишите программу, которая выводит все четные и нечетные числа от 1 до 20

// for (let i = 1; i <= 20; i++) {
//     if (i % 2 === 0) {
//         console.log(i + " - четное")
//     } else {
//         console.log(i + " - нечетное")
//     }
// }

///////////////////////////////////////////////

// 4 Вам дано сток с str = 'программированный' Напишите программу, которая выводит их в обратном порядке.

// let str = 'программированный'

// for (i = str.length - 1; i >= 0; i--) {
//     console.log(str[i])
// }

///////////////////////////////////////////////

// 5 Напишите программу, которая выводит на экран квадраты всех чисел от 1 до 10.

// for (let i = 1; i <= 10; i++) {
//     console.log(i + " в квадрате равно " + (i * i));
// }

///////////////////////////////////////////////

